{"data":{"site":{"siteMetadata":{"title":"Blog by Tek Fun","subtitle":"I am a web developer. I love Javascript, ReactJS. With passion, curiosity, I learn for food, work for fun and share for the future. "}},"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/posts/how-about-useEffect/","categorySlug":"/category/react-js/"},"frontmatter":{"title":"How about useEffect in Hooks.","date":"2019-06-10T23:46:37.121Z","category":"ReactJS","description":"Bắt đầu từ version 16.8.xx React Team của Facebook đã đưa ra Hooks một số function mới và theo bản thân mình thì nó làm thay đổi khá nhiều về cách code 1 Component, cũng chạy theo trend nên mình cũng đã áp dụng vào một vài dự án và thấy một vài trải nghiệm thú vị nên viết bài này để chia sẽ một vài trải nghiệm của mình với 1 effect trong Hooks là useEffect"}}},{"node":{"fields":{"slug":"/posts/how-are-function-component-different-from-classes/","categorySlug":"/category/react-js/"},"frontmatter":{"title":"How are function component different from classes","date":"2019-02-10T23:46:37.121Z","category":"ReactJS","description":"Chắc hẳn ai đã từng nghiên cứu hoặc làm việc với ReactJS cũng đã từng đặt ra suy nghĩ, thắc mắc về Class và Function Component, khi nào thì sử dụng, và nó khác nhau như thế nào. Hay một số người lại cho rằng cái này tốt hơn cái kia..."}}},{"node":{"fields":{"slug":"/posts/react-pattern-part-two/","categorySlug":"/category/react-js/"},"frontmatter":{"title":"React Pattern Part 2","date":"2018-11-20T23:46:37.121Z","category":"ReactJS","description":"Khi làm việc với ReactJS chúng ta nên chú ý đến những Pattern này. Chúng đều được nói đến trong Document của ReactJS nhưng thật sự ít ai để ý đến, Trong bài viết này mình sẽ nói qua về những pattern này"}}},{"node":{"fields":{"slug":"/posts/how-and-when-use-react-context-api/","categorySlug":"/category/react-js/"},"frontmatter":{"title":"Làm thế nào và khi nào thì nên sử dụng React Context Api","date":"2018-09-09T23:46:37.121Z","category":"ReactJS","description":"Từ React 16.3 chắc hẳn mọi người đã biết đến 1 tính năng mới đó New Context Api, nhưng sử dụng nó như thế nào và trong trường hợp nào, nó có ích như thế nào thì trong bài này mình xin được chia sẽ 1 chút tìm hiểu của mình về nó"}}}]}},"pageContext":{"tag":"Javascript","currentPage":0,"postsLimit":4,"postsOffset":0,"prevPagePath":"/tag/javascript","nextPagePath":"/tag/javascript/page/1","hasPrevPage":false,"hasNextPage":true}}